// 100 分
// 1. 考点,变量提升以及 TDZ(临时死区),undefined,ReferenceError,D
// 2. 考点,块级作用域绑定,C
// 3. 考点,箭头函数的基本语法,this 和 arguments 会继承自最近的词法作用域执行时的上下文对象,以及正式方法的 this 绑定,B
// 4. 考点,你不知道的 Javascript,A
// 5. 考点,可计算的对象属性方法,A
// 6. 考点,对象引用,A
// 7. 考点,全等于隐式转换,C
// 8. 考点,解构赋值,解构参数,解构参数默认值,解构参数必须传值,D
// 9. 考点,var 全局作用域绑定,变量提升,A
// 10. 考点,函数作为对象,A
// 11. 考点,原型链,A
// 12. 考点,构造调用构造对象,A
// 13. 考点,事件捕获以及事件冒泡,D
// 14. 考点,基本知识,基本类型常量没有原型,B
// 15. 考点,字符串,C
// 16. 考点,运算符,C
// 17. 考点,模板标签,字符串集合长度 - 变量集合长度 = 1,B
// 18. 考点,全等于,相等于,C
// 19. 考点,不定参数,注意参数集合必须在参数的末尾,C
// 20. 考点,严格模式下,不得不声明赋值,C