// 100 分
// 1. 考点,变量提升以及 TDZ(临时死区),undefined,ReferenceError,D
// 2. 考点,块级作用域绑定,C
// 3. 考点,箭头函数的基本语法,this 和 arguments 会继承自最近的词法作用域执行时的上下文对象,以及正式方法的 this 绑定,B
// 4. 考点,你不知道的 Javascript,A
// 5. 考点,可计算的对象属性方法,A
// 6. 考点,对象引用,A
// 7. 考点,全等于隐式转换,C
// 8. 考点,解构赋值,解构参数,解构参数默认值,解构参数必须传值,D
// 9. 考点,var 全局作用域绑定,变量提升,A
// 10. 考点,函数作为对象,A
// 11. 考点,原型链,A
// 12. 考点,构造调用构造对象,A
// 13. 考点,事件捕获以及事件冒泡,D
// 14. 考点,基本知识,基本类型常量没有原型,B
// 15. 考点,字符串,C
// 16. 考点,运算符,C
// 17. 考点,模板标签,字符串集合长度 - 变量集合长度 = 1,B
// 18. 考点,全等于,相等于,C
// 19. 考点,不定参数,注意参数集合必须在参数的末尾,C
// 20. 考点,严格模式下,不得不声明赋值,C

// 100 分
// 21. 考点,被 eval 语法包裹,注释紧跟 eval 语法,备注其所输出于的源代码位置目录,A
// 22. 考点,sessionStorage 基础,B
// 23. 考点,var 特性,重复声明,B
// 24. 考点,Set 基本用法,C
// 25. 考点,重复的对象属性方法,C
// 26. 考点,this 词法作用域执行时的上下文对象,A
// 27. 考点,for 循环基础, C
// 28. 考点,字符串强制类型转换之后调用原型链上面的方法,A
// 29. 考点,对象强制类型转换为字符串 [object Object],B
// 30. 考点,事件执行机制,B
// 31. 考点,事件触发机制,C
// 32. 考点,事件触发机制,A
// 33. 考点,this,词法作用域执行时的上下文对象,D
// 34. 考点,IIFE 自执行函数表达式,箭头函数基本用法,B
// 35. 考点,基本类型数据以及引用类型数据的强制类型转换,A
// 36. 考点,数据类型,B
// 37. 考点,const 常量声明,添加引用类型数据,C
// 38. 考点,try-catch 用法,A
// 39. 考点,js 基础,A
// 40. 考点,reduce 用法(默认值),C
// 41. 考点,强制类型转换,B
// 42. 考点,setInterval 用法,A
// 43. 考点,展开运算符,可迭代对象(字符串),默认迭代器针对的是字符串中的字符,A
// 44. 考点,生成器的基本用法,C
